Tekla Open API Reference for Tekla Structures 2025
LeaderLineAndParentObjectAlongPartPlacingType Constructor
 Creates a new leader line and parent object along part placing type instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LeaderLineAndParentObjectAlongPartPlacingType()
Public Sub New
See Also
Reference
LeaderLineAndParentObjectAlongPartPlacingType Class
Tekla.Structures.Drawing Namespace